ckcd1hp/First-Test-ESP32/src/main.cpp
#include <NTPClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <WiFiUdp.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <ESPAsyncWebServer.h>
#include <SPIFFS.h>
#include <ESP32Time.h>
#include <WebSerial.h>
#include <AsyncElegantOTA.h>
#include <UniversalTelegramBot.h>
#include <ArduinoJson.h>
#include <Preferences.h>

#include "config.h"
#include "pins.h"
#include "waterLevel.h"
#include "dhtReadings.h"

#define UTC_OFFSET_IN_SECONDS -36000       // offset from greenwich time (Hawaii is UTC-10)
#define NTP_SYNC_HOUR 4                    // sync NTP at 4am
#define NUTRIENT_REMINDER_HOUR 9           // send reminder at 9 am
#define WIFI_RETRY_WAIT_TIME 300000        // 5 minutes in milliseconds
#define NTP_UPDATE_INTERVAL 1800000        // 30 min in milliseconds (minimum retry time, normally daily)
#define NUTRIENT_REMINDER_INTERVAL 1209600 // 2 weeks in seconds
#define ADC_SAMPLING_INTERVAL 50           // 50 milliseconds is 20 samples in 1 second
#define STATUS_UPDATE_INTERVAL 10000       // 10 seconds
#define SOUND_SPEED 0.0343                 // cm/microsecond
#define NUM_SAMPLES 20                     // number of samples to take for current sensor
#define CURRENT_GAIN 3                     // multiply current by 3

// #define DEBUG

#ifdef DEBUG
#define DebugLog(message)      \
  WebSerial.print("[DEBUG] "); \
  WebSerial.println(message)
#else
#define DebugLog(message)
#endif

// function declarations
void WiFiStationConnected(WiFiEvent_t event, WiFiEventInfo_t info);                                  // on connect to Wifi
void WiFiGotIP(WiFiEvent_t event, WiFiEventInfo_t info);                                             // on IP received from Wifi
void WiFiStationDisconnected(WiFiEvent_t event, WiFiEventInfo_t info);                               // on disconnect from Wifi
void updateAndSyncTime();                                                                            // update time from NTP server and sync to RTC
String processor(const String &var);                                                                 // update web page with variables
unsigned long setInterval(void (*callback)(), unsigned long previousMillis, unsigned long interval); // run function at interval

void overridePump(int pump_pin, int state, int time);   // put a pump in override
void setPumpAuto(int pump_pin);                         //  set a pump back to auto
void controlPumps(int currentHour, int currentMin);     // control water pumps in auto or override
void checkPumpAlarms();                                 // check if pump status doesn't match command
void updatePumpStatuses();                              // update web with pump statuses
void checkOverrideStatuses(int currentSecond);          // check override statuses every second
void sampleCurrent();                                   // sample current every 50 milliseconds
void updateNutrientReminder();                          // when user adds plant food, set new reminder 2 weeks out
void sendNutrientReminder();                            // when nutrient date passes, send notification and update web
String getNewNutrientDate(unsigned long nutrientEpoch); // convert epoch to formatted date string
void handleNewMessages(int numNewMessages);             // handling new messages from telegram user

// Define NTP Client to get time
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", UTC_OFFSET_IN_SECONDS, NTP_UPDATE_INTERVAL);
ESP32Time rtc; // no offset, as that is already added from NTPClient
String lastNTPSync = "";

// time counters
unsigned long wifiPrevMillis = 0;
unsigned long adcSamplingMillisCounter = 0;
unsigned long statusUpdateMillisCounter = 0;
// plant nutrient reminder
unsigned long nutrientReminderEpoch = 0;
// sampling variables
bool beginSampling = false;
int samplingCounter = 0;
float pump1Samples = 0.0;
float pump2Samples = 0.0;
float airPumpSamples = 0.0;
// time variables
unsigned long now;
int previousDay = -1;    // track the last day to send new notifications
int previousHour = -1;   // track the last hour to run functions once an hour
int previousMinute = -1; // track the last minute to run functions on the new minute
int previousSecond = -1; // track the last second to run functions on the new second

// create AsyncWebServer on port 80
AsyncWebServer server(80);
// Create an Event Source on /events
AsyncEventSource events("/events");
// Telegram bot
WiFiClientSecure client;
UniversalTelegramBot bot(BOT_TOKEN, client);
// Preferences
Preferences preferences;

bool pump1Command = false;
bool pump1Override = false;
bool pump1Status = false;
unsigned long pump1OverrideTimeEpochEnd = 0; // if pump overriden for 5 min, this will be set to current epoch + 5*60
bool pump2Command = false;
bool pump2Override = false;
bool pump2Status = false;
unsigned long pump2OverrideTimeEpochEnd = 0; // if pump overriden for 5 min, this will be set to current epoch + 5*60
bool airPumpCommand = false;                 // toggle
bool airPumpOverride = false;
bool airPumpStatus = false;
unsigned long airPumpOverrideTimeEpochEnd = 0; // if pump overriden for 5 min, this will be set to current epoch + 5*60
float mvPerAmp = 0.185;                        // sensitivity for ACS712 5A current sensor
bool readyToConnectWifi = true;                // ready to try connecting to wifi

// GET REQUEST PARAMETERS
const char *PARAM_OUTPUT = "output";
const char *PARAM_STATE = "state";
const char *PARAM_TIME = "time";
// ALARMS
bool pump1Alarm = false;
bool pump2Alarm = false;
bool airPumpAlarm = false;
bool lowWaterAlarm = false;
bool lowerWaterAlarmAck = false;
bool nutrientAlarm = false;
// alarm after 1 minute of command/status mismatch
unsigned long pump1AlarmTimeEpochEnd = 0;
unsigned long pump2AlarmTimeEpochEnd = 0;
unsigned long airPumpAlarmTimeEpochEnd = 0;
// temp, humidity, heat index
extern float f, hif, h;

void setup()
{
  Serial.begin(115200);
  Serial.println("Setup begin");
  // set pinout
  pinMode(LED_PIN, OUTPUT);
  pinMode(WATER_PUMP_1_PIN, OUTPUT);
  pinMode(WATER_PUMP_2_PIN, OUTPUT);
  pinMode(AIR_PUMP_PIN, OUTPUT);
  // water pump current pins are input only (34 and 35) and don't need to be set
  pinMode(AIR_PUMP_CURRENT, INPUT);

  dht.begin();
  ultrasonicSensor.begin();

