ckcd1hp/First-Test-ESP32/src/main.cpp
    pump1Override = false;
    pump1OverrideTimeEpochEnd = 0;
    // Send Events to the Web Client with the Sensor Readings
    String command = (pump1Command) ? " On " : " Off ";
    String pumpCommand = command + "(Auto)";
    events.send(pumpCommand.c_str(), "pump1Command", millis());
  }
  else if (pump_pin == WATER_PUMP_2_PIN)
  {
    if (currentHour >= 12 and currentHour < 18)
    {
      pump2Command = true;
      digitalWrite(WATER_PUMP_2_PIN, HIGH);
    }
    else
    {
      pump2Command = false;
      digitalWrite(WATER_PUMP_2_PIN, LOW);
    }
    pump2Override = false;
    pump2OverrideTimeEpochEnd = 0;
    // Send Events to the Web Client with the Sensor Readings
    String command = (pump2Command) ? " On " : " Off ";
    String pumpCommand = command + "(Auto)";
    events.send(pumpCommand.c_str(), "pump2Command", millis());
  }
  else
  {
    airPumpCommand = true;
    digitalWrite(AIR_PUMP_PIN, HIGH); // switching back to auto will just turn it on, it'll go back to 15 min on/off
    airPumpOverride = false;
    airPumpOverrideTimeEpochEnd = 0;
    // Send Events to the Web Client with the Sensor Readings
    String pumpCommand = "On (Auto)";
    events.send(pumpCommand.c_str(), "airPumpCommand", millis());
  }
}
void controlPumps(int currentHour, int currentMin)
{
  // function runs once a minute
  // water pump 1
  if (!pump1Override)
  {
    // Run water pump 1 from 6am to 12pm continuously.  The other 12 hours, the pump will run for 1 min on the hour
    if (currentHour >= 6 and currentHour < 12)
      pump1Command = true;
    else if (currentMin == 0)
      pump1Command = true;
    else
      pump1Command = false;
  }
  // water pump 2
  if (!pump2Override)
  { // auto mode
    // Run water pump 2 from 12pm to 6pm continuously.  The other 12 hours, the pump will run for 1 min on the half hour
    if (currentHour >= 12 and currentHour < 18)
      pump2Command = true;
    else if (currentMin == 30)
      pump2Command = true;
    else
      pump2Command = false;
  }
  // air pump
  if (!airPumpOverride)
  { // auto mode
    // Toggle air pump every 15 minutes between 6 am and 6pm
    if (currentHour >= 6 and currentHour < 18)
    {
      if (currentMin % 15 == 0)
      {
        airPumpCommand = !airPumpCommand;
        // Send Events to the Web Client with Air Pump Command
        String command = (airPumpCommand) ? " On " : " Off ";
        String pumpCommand = command + "(Auto)";
        events.send(pumpCommand.c_str(), "airPumpCommand", millis());
      }
    }
    else if (currentHour == 18 and currentMin == 0)
    {
      airPumpCommand = false;
      // Send Events to the Web Client with Air Pump Command
      String command = (airPumpCommand) ? " On " : " Off ";
      String pumpCommand = command + "(Auto)";
      events.send(pumpCommand.c_str(), "airPumpCommand", millis());
    }
  }
  // set pump1 command
  digitalWrite(WATER_PUMP_1_PIN, pump1Command ? HIGH : LOW);
  // set pump2 command
  digitalWrite(WATER_PUMP_2_PIN, pump2Command ? HIGH : LOW);
  // set air pump command
  digitalWrite(AIR_PUMP_PIN, airPumpCommand ? HIGH : LOW);
}
// check override statuses every second
void checkOverrideStatuses(int currentSecond)
{
  unsigned long epoch = rtc.getEpoch();
  if (pump1Override)
  {
    // pump1 is in override for set duration (set by user from webpage)
    // update web page every minute
    if (currentSecond == 0)
    {
      // if it is 0 it is in permanent override
      if (pump1OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump1Command) ? "On " : "Off ";
        unsigned long timeLeftMin = (pump1OverrideTimeEpochEnd - epoch) / 60;
        String timeLeft = command + "(Override " + String(timeLeftMin) + " min)";
        if (timeLeftMin != 0) // avoid sending 0 min left
          events.send(timeLeft.c_str(), "pump1Command", millis());
      }
    }
    // if epoch has passed the end time, set pump to auto
    if (epoch >= pump1OverrideTimeEpochEnd and pump1OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_1_PIN);
    }
  }
  if (pump2Override)
  {
    // pump2 is in override for set duration (set by user from webpage)
    // update web page every minute
    if (currentSecond == 0)
    {
      if (pump2OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump2Command) ? "On " : "Off ";
        unsigned long timeLeftMin = (pump2OverrideTimeEpochEnd - epoch) / 60;
        String timeLeft = command + "(Override " + String(timeLeftMin) + " min)";
        if (timeLeftMin != 0) // avoid sending 0 min left
          events.send(timeLeft.c_str(), "pump2Command", millis());
      }
    }
    // if pump2OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (epoch >= pump2OverrideTimeEpochEnd and pump2OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_2_PIN);
    }
  }
  if (airPumpOverride)
  {
    // air pump is in override for set duration (set by user from webpage)
    // update web page every minute
    if (currentSecond == 0)
    {
      if (airPumpOverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (airPumpCommand) ? "On " : "Off ";
        unsigned long timeLeftMin = (airPumpOverrideTimeEpochEnd - epoch) / 60;
        String timeLeft = command + "(Override " + String(timeLeftMin) + " min)";
        if (timeLeftMin != 0) // avoid sending 0 min left
          events.send(timeLeft.c_str(), "airPumpCommand", millis());
      }
    }
    // if pump2OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (epoch >= airPumpOverrideTimeEpochEnd and airPumpOverrideTimeEpochEnd != 0)
    {
      setPumpAuto(AIR_PUMP_PIN);
    }
  }
}
void updatePumpStatuses()
{
  // Send Events to the Web Client with the pump statuses (every 10 seconds)
  String p1String = (pump1Status) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  String p2String = (pump2Status) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  String airPString = (airPumpStatus) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  events.send(p1String.c_str(), "pump1Status", millis());
  events.send(p2String.c_str(), "pump2Status", millis());
  events.send(airPString.c_str(), "airPumpStatus", millis());
}
void sampleCurrent()
{
  // sample current every 50 milliseconds
  if (samplingCounter < NUM_SAMPLES)
  {
    // add to samples
    pump1Samples += analogRead(WATER_PUMP_1_CURRENT);
    pump2Samples += analogRead(WATER_PUMP_2_CURRENT);
    airPumpSamples += analogRead(AIR_PUMP_CURRENT);
    samplingCounter++;
  }
  else
  {
    // calculate average
    pump1Samples /= NUM_SAMPLES;
    pump2Samples /= NUM_SAMPLES;
    airPumpSamples /= NUM_SAMPLES;
    // convert to voltage
    pump1Samples = pump1Samples * (3.3 / 4095) - 1.52;
    pump2Samples = pump2Samples * (3.3 / 4095) - 1.52;
    airPumpSamples = airPumpSamples * (3.3 / 4095) - 1.52;
    // calculate amps
    float pump1Current = pump1Samples * CURRENT_GAIN / mvPerAmp;
    float pump2Current = pump2Samples * CURRENT_GAIN / mvPerAmp;
    float airPumpCurrent = airPumpSamples * CURRENT_GAIN / mvPerAmp;
    // update pump statuses
    pump1Status = (pump1Current > 0.5) ? true : false;
    pump2Status = (pump2Current > 0.5) ? true : false;
    airPumpStatus = (airPumpCurrent > 0.3) ? true : false;
    // write status to web
    updatePumpStatuses();
    // debug
    DebugLog("Pump 1 Current: " + String(pump1Current));
    DebugLog("Pump 2 Current: " + String(pump2Current));
    DebugLog("Air Pump Current: " + String(airPumpCurrent));
    // reset counter
    samplingCounter = 0;
    // reset samples
    pump1Samples = 0.0;
    pump2Samples = 0.0;
    airPumpSamples = 0.0;
    // reset begin sampling
    beginSampling = false;
  }
}
void checkPumpAlarms()
{
  if (pump1Command != pump1Status)
  {
    if (pump1AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump1Alarm)
      {
        pump1AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        // Serial.println("Starting pump1 alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump1AlarmTimeEpochEnd)
      {
        // set alarm
        pump1Alarm = true;
        pump1AlarmTimeEpochEnd = 0;
        // send alarm to web
        String p1Alarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Water Pump 1";
        events.send(p1Alarm.c_str(), "waterPump1Header", millis());
        // send alarm to bot
        const String botPump1FailMessage = BOT_PUMP_FAIL_MESSAGE_1 + String("Water Pump 1") + BOT_PUMP_FAIL_MESSAGE_2;
        bot.sendMessage(CHAT_ID, botPump1FailMessage);
        // Serial.println("Pump1 alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    pump1AlarmTimeEpochEnd = 0;
    if (pump1Alarm)
    {
      pump1Alarm = false;
      String p1 = "Water Pump 1";
      events.send(p1.c_str(), "waterPump1Header", millis());
      // Serial.println("Pump1 alarm cleared");
    }
  }
  // check pump2
  if (pump2Command != pump2Status)
  {
    if (pump2AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump2Alarm)
      {
        pump2AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        // Serial.println("Starting pump2 alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump2AlarmTimeEpochEnd)
      {
        // set alarm
        pump2Alarm = true;
        pump2AlarmTimeEpochEnd = 0;
        // send alarm to web
        String p2Alarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Water Pump 2";
        events.send(p2Alarm.c_str(), "waterPump2Header", millis());
        // send alarm to bot
        // send alarm to bot
        const String botPump1FailMessage = BOT_PUMP_FAIL_MESSAGE_1 + String("Water Pump 2") + BOT_PUMP_FAIL_MESSAGE_2;
        bot.sendMessage(CHAT_ID, botPump1FailMessage);
        // Serial.println("Pump2 alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    pump2AlarmTimeEpochEnd = 0;
    if (pump2Alarm)
    {
      pump2Alarm = false;
      String p2 = "Water Pump 2";
      events.send(p2.c_str(), "waterPump2Header", millis());
      // Serial.println("Pump2 alarm cleared");
    }
  }
  // check air pump
  if (airPumpCommand != airPumpStatus)
  {
    if (airPumpAlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!airPumpAlarm)
      {
        airPumpAlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        // Serial.println("Starting air pump alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= airPumpAlarmTimeEpochEnd)
      {
        // set alarm
        airPumpAlarm = true;
        airPumpAlarmTimeEpochEnd = 0;
        // send alarm to web
        String airPumpAlarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Air Pump";
        events.send(airPumpAlarm.c_str(), "airPumpHeader", millis());
        // send alarm to bot
        bot.sendMessage(CHAT_ID, BOT_AIR_PUMP_FAIL_MESSAGE);
        // Serial.println("Air pump alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    airPumpAlarmTimeEpochEnd = 0;
    if (airPumpAlarm)
    {
      airPumpAlarm = false;
      String p = "Air Pump";
      events.send(p.c_str(), "airPumpHeader", millis());
      Serial.println("Air Pump alarm cleared");
    }
  }
}
void updateNutrientReminder()
{
  // clear alarm
  nutrientAlarm = false;
  // set next reminder
  nutrientReminderEpoch = rtc.getEpoch() + NUTRIENT_REMINDER_INTERVAL;
  WebSerial.println(String(nutrientReminderEpoch));
  // save to preferences
  preferences.begin("nft", false);
  preferences.putULong("nutrientReminderEpoch", nutrientReminderEpoch);
  preferences.end();
  // update web
  String nutrientDate = "<span style = \"color:#000000;\">" + getNewNutrientDate(nutrientReminderEpoch) + "</span>";
  events.send(nutrientDate.c_str(), "nutrientReminder", millis());
}
void sendNutrientReminder()
{
  // check if it is time to send nutrient reminder
  if (rtc.getEpoch() >= nutrientReminderEpoch and nutrientReminderEpoch != 0)
  {
    nutrientAlarm = true;
    // send reminder
    bot.sendMessage(CHAT_ID, BOT_NUTRIENT_REMINDER_MESSAGE);
    // update web
    String nutrientDate = "<span style = \"color:#c81919;\">" + getNewNutrientDate(nutrientReminderEpoch) + "</span>";
    events.send(nutrientDate.c_str(), "nutrientReminder", millis());
  }
}
String getNewNutrientDate(unsigned long nutrientEpoch)
{
  time_t now = (time_t)nutrientEpoch;
  struct tm timeInfo;
  // time(&now);                   // get current time
  localtime_r(&now, &timeInfo); // convert time_t to struct tm
  // timeInfo.tm_mday += 14;       // add 2 weeks
  // now = mktime(&timeInfo);      // make time with new days
  // localtime_r(&now, &timeInfo); // convert new time_t to struct tm
  char formattedTime[50];
  strftime(formattedTime, 51, "%D", &timeInfo);
  return String(formattedTime);
}
// Handle what happens when you receive new messages from telegram bot
void handleNewMessages(int numNewMessages)
{
  // WebSerial.println("New messages from telegram: " + String(numNewMessages));
  for (int i = 0; i < numNewMessages; i++)
  {
    // Chat id of the requester
    String chat_id = String(bot.messages[i].chat_id);
    if (chat_id != CHAT_ID)
    {
      bot.sendMessage(chat_id, BOT_UNAUTHORIZED_MESSAGE);
      continue;
    }
    // Print the received message
    String msg = bot.messages[i].text;
    String from_name = bot.messages[i].from_name;

    if (msg == "/start")
    {
      String welcome = "Welcome, " + from_name + ".\n";
      welcome += "Use the following commands to control your outputs.\n\n";
      welcome += "/led_on to turn GPIO ON \n";
      welcome += "/led_off to turn GPIO OFF \n";
      welcome += "/state to request current GPIO state \n";
      bot.sendMessage(chat_id, welcome, "");
    }
    else if (msg == "/led2on")
    {
      digitalWrite(LED_PIN, HIGH);
      bot.sendMessage(chat_id, "Kashikomarimashita! LED2 is now on!");
    }
    else if (msg == "/led2off")
    {
      digitalWrite(LED_PIN, LOW);
      bot.sendMessage(chat_id, "Kashikomarimashita! LED2 is now off!");
    }
    else if (msg == "/resetnutrientdate")
    {
      // load saved data
      preferences.begin("nft", false);
      nutrientReminderEpoch = rtc.getEpoch();
      nutrientReminderEpoch = preferences.putULong("nutrientReminderEpoch", nutrientReminderEpoch);
      preferences.end();
    }
  }
}
